Documents/ЗаданиеАудитору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ЗаданиеАудитору</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаданийАудиторам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗадания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗаданийАудитору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аудитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАудита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторнаяДатаАудита</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маркер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.МаркерыДляАудита</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаАудитаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторнаяДатаАудитаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПриложенныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайлаСРасширением</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пользователь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
								<v8:Type>cfg:CatalogRef.ПерсоналККМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыЗаданийАудитору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыЗаданийАудитору</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроверитьЭтикетку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьЭтикетку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АудитПроизводителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоискНовыхПроизводителей</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЗаданиеАудитору/Forms/ФормаДокументаБезДетализации/Ext/Form/Module.bsl
&НаСервере
Функция ЭтоАудитор()
	
	Возврат РольДоступна("АудиторТоваров");
	
КонецФункции 


&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если ЭтоАудитор() Тогда
		Отказ = Истина;
		
		ПараметрыФормы = Новый Структура("Ключ", Объект.Ссылка);
		ОткрытьФорму("Документ.ЗаданиеАудитору.Форма.ФормаДляАудитора", ПараметрыФормы);
	КонецЕсли;
	
	
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура ТипЗаданияПриИзменении(Элемент)
	
	УстановитьВидимость();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()

	Элементы.Номенклатура.Видимость = НЕ (Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.АудитПроизводителя"));
	Элементы.ХарактеристикаНоменклатуры.Видимость = (Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.ПроверитьЭтикетку") ИЛИ Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.СоздатьЭтикетку"));
    Элементы.Производитель.Видимость = (Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.АудитПроизводителя"));

	Элементы.ГруппаТовары.Видимость = НЕ (Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.ПроверитьЭтикетку") ИЛИ Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.СоздатьЭтикетку"));

	Элементы.ТоварыНоменклатура.Видимость = (Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.АудитПроизводителя"));
	Элементы.ТоварыХарактеристикаНоменклатурыКонтекстноеМеню.Видимость = (Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.ПоискНовыхПроизводителей"));


КонецПроцедуры 

&НаКлиенте
Процедура ХарактеристикаНоменклатурыОткрытие(Элемент, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;

	//СтруктураПараметров = Новый Структура();
	//СтруктураПараметров.Вставить("Ключ", Объект.ХарактеристикаНоменклатуры);
	//СтруктураПараметров.Вставить("ТипЗадания", Объект.ТипЗадания);

	//ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаДляАудита", СтруктураПараметров);

КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Если Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.ПоискНовыхПроизводителей") Тогда
		ЗаполнитьХарактеристикиПоНоменклатуре();
				
	ИначеЕсли Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.ПроверитьЭтикетку") ИЛИ 
					    Объект.ТипЗадания = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.СоздатьЭтикетку") Тогда
		
		УстановитьХарактеристику();
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура УстановитьХарактеристику()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец
	|	И НЕ ХарактеристикиНоменклатуры.Неактивная");
	
	Запрос.УстановитьПараметр("Владелец", Объект.Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		Объект.ХарактеристикаНоменклатуры = Выборка.Ссылка;
	КонецЕсли; 	
		
КонецПроцедуры		
		
&НаСервере
Процедура ЗаполнитьХарактеристикиПоНоменклатуре()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаНоменклатуры
	                      |ИЗ
	                      |	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	                      |ГДЕ
	                      |	ХарактеристикиНоменклатуры.Владелец = &Владелец
	                      |	И НЕ ХарактеристикиНоменклатуры.Неактивная
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ХарактеристикиНоменклатуры.Наименование");
	
	Запрос.УстановитьПараметр("Владелец", Объект.Номенклатура);

	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры 

&НаКлиенте
Процедура ПроизводительПриИзменении(Элемент)

	ЗаполнитьНоменклатуруПоПроизводителю();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНоменклатуруПоПроизводителю()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗначенияСвойствОбъектов.Объект.Владелец КАК Номенклатура, 	ЗначенияСвойствОбъектов.Объект КАК ХарактеристикаНоменклатуры
	                      |ИЗ
	                      |	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	                      |ГДЕ
	                      |	ЗначенияСвойствОбъектов.Свойство = ЗНАЧЕНИЕ(ПланВидовХарактеристик.СвойстваОбъектов.Производитель)
	                      |	И ЗначенияСвойствОбъектов.Значение = &Значение
	                      |	И НЕ ЗначенияСвойствОбъектов.Объект.Неактивная");
	
	Запрос.УстановитьПараметр("Значение", Объект.Производитель);

	Объект.Товары.Загрузить(Запрос.Выполнить().Выгрузить());

	Объект.Товары.Сортировать("Номенклатура"); 
	
КонецПроцедуры 


&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	//СтандартнаяОбработка = Ложь;

	//СтруктураПараметров = Новый Структура();
	//СтруктураПараметров.Вставить("Ключ", Элементы.Товары.ТекущиеДанные.ХарактеристикаНоменклатуры);
	//СтруктураПараметров.Вставить("ТипЗадания", Объект.ТипЗадания);

	//ОткрытьФорму("Справочник.ХарактеристикиНоменклатуры.Форма.ФормаДляАудита", СтруктураПараметров);

КонецПроцедуры

&НаКлиенте
Процедура ТипЗаданияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ВыбранноеЗначение <> Объект.ТипЗадания Тогда
		Объект.Товары.Очистить();
		
		Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.АудитПроизводителя")  Тогда
			Объект.Номенклатура = Неопределено;
		Иначе
			Объект.Производитель = Неопределено;
		КонецЕсли; 
		
		Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.ТипыЗаданийАудитору.ПоискНовыхПроизводителей")  Тогда
			ЗаполнитьХарактеристикиПоНоменклатуре();
		КонецЕсли; 

	КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ХарактеристикаНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ФормаВыбора = Справочники.ХарактеристикиНоменклатуры.ПолучитьФормуВыбора(, Элемент);
	
	ФормаВыбора.СправочникСписок.Отбор.Владелец.Установить(Объект.Номенклатура);
	ФормаВыбора.СправочникСписок.Отбор.Неактивная.Установить(Ложь);
	
	ФормаВыбора.Открыть();
	
КонецПроцедуры
